
export default {
  common: {
    cancel: 'Скасувати',
  },
  welcomeScreen: {
    title: 'Ласкаво просимо до PrEPy',
    subtitle: 'Ваш розумний помічник із PrEP на вимогу. Відстежуйте свої дози, залишайтеся захищеними та впевнено керуйте своїми сесіями.',
    cta: 'Почати сесію PrEP',
  },
  welcomeDialog: {
    title: 'Активувати сповіщення',
    description: {
      part1: 'Для вашої безпеки настійно рекомендується активувати сповіщення. Це дозволить PrEPy надсилати вам нагадування про прийом таблеток.',
      part2: 'Пропуск нагадування може поставити під загрозу ваш захист.',
    },
    confirm: 'Зрозуміло, активувати сповіщення',
  },
  settings: {
    title: 'Налаштування',
    description: 'Керуйте своїми даними та вподобаннями.',
    notifications: {
      title: 'Сповіщення',
      description: 'Отримуйте нагадування про кожну дозу, щоб забезпечити свій захист.',
      enabled: 'Сповіщення ввімкнено',
      disabled: 'Сповіщення вимкнено',
      loading: 'Завантаження...',
      denied: 'Ви заблокували сповіщення. Щоб знову їх увімкнути, ви повинні дозволити сповіщення для цього сайту в налаштуваннях вашого браузера, а потім перезавантажити сторінку.',
      disabledWarning: 'Нагадування про дози вимкнено. Ви не отримуватимете жодних сповіщень, що може призвести до пропуску доз.',
    },
    language: {
      title: 'Мова',
      description: 'Виберіть мову відображення програми.',
      select: 'Виберіть мову',
    },
clearHistory: {
      button: 'Видалити мою історію',
      dialog: {
        title: 'Ви абсолютно впевнені?',
        description: 'Ця дія є незворотною. Усі дані вашої сесії та історія прийому таблеток будуть остаточно видалені.',
        confirm: 'Так, видалити мої дані',
      },
    },
  },
  logDoseDialog: {
    initial: {
      title: 'Почніть вашу сесію',
      description: 'Ви почнете з 2 таблеток. Підтвердьте, коли ви прийняли початкову дозу.',
    },
    regular: {
      title: 'Зареєструйте свою дозу',
      description: 'Підтвердьте, коли ви прийняли таблетку.',
    },
    missed: {
      title: 'Пропущена доза',
      description: 'Здається, ви пропустили дозу. Виберіть опцію, щоб оновити свій статус.',
      earlier: 'Я прийняв 1 таблетку раніше',
      restart: 'Перезапустити з 2 таблетками',
    },
    picker: {
      description: 'Виберіть дату та час прийому {count} таблетки(ок).',
      confirm: 'Підтвердити час',
    },
    pills: {
      earlier: 'Я прийняв {count} таблетки(ок) раніше',
      now: 'Я прийняв {count} таблетки(ок) зараз',
    },
  },
  doseHistory: {
    title: 'Журнал',
    description: 'Ваші дії за останні 90 днів.',
    event: {
      start: 'Сесія розпочата',
      dose: 'Таблетку прийнято',
      stop: 'Сесію завершено',
      unknown: 'Невідома подія',
    },
    empty: {
      title: 'Жодних дій не зареєстровано.',
      subtitle: 'Почніть сесію, щоб почати.',
    },
  },
  status: {
    inactive: 'Неактивно',
    loading: 'Захист очікується...',
    effective: 'Захист активний',
    missed: 'Дозу пропущено',
    lapsed: 'Захист припинено',
    ended: 'Сесію завершено',
    loadingClient: 'Завантаження...',
    riskWarning: 'Якщо у вас був незахищений секс поза періодом захисту, будь ласка, пройдіть тестування.',
  },
  protection: {
    startsIn: 'Буде активним через {time}',
    text: {
      lapsed: 'Ви пропустили одну або декільka доз. Ваш захист більше не гарантується.',
      lessThan3doses: 'Якщо ви продовжите приймати дози до {dateTroisiemeJour}, ваші стосунки між {datePriseDemarrage} та {dateLendemain} будуть захищені.',
      moreThan3doses: 'Ваші стосунки до {dateAvantDernierePrise} захищені PrEP.',
    },
  },
  dose: {
    nextIn: 'Наступна доза через {time}',
    timeLeft: 'У вас є {time}, щоб прийняти таблетку',
    now: 'Прийміть таблетку зараз!',
  },
  dashboard: {
    logDose: 'Я прийняв свою дозу',
    endSession: 'Завершити сесію',
    startSession: 'Почати нову сесію',
    stopPrepInfo: 'Щоб припинити прийом PrEP, продовжуйте приймати по 1 таблетці на день протягом 2 днів після останнього статевого акту.',
    endSessionDialog: {
      title: 'Завершити сесію PrEP?',
      description: 'Це зупинить нагадування про сповіщення. Ваш захист буде розраховано на основі вашої останньої дози.',
      confirm: 'Так, завершити',
    },
  },
  session: {
    end: {
      toast: {
        title: 'Сесію завершено',
        description: 'Нагадування про сповіщення тепер зупинено.',
      },
    },
    clear: {
      toast: {
        dev: 'Тестові дані перезавантажено',
        title: 'Дані очищено',
        description: 'Вашу історію та вподобання було видалено.',
      },
    },
  },
  notifications: {
    toast: {
      unsupported: 'Браузер не підтримується',
      denied: {
        title: 'Сповіщення відхилено',
        description: 'Ви можете повторно активувати їх у налаштуваннях вашого браузера.',
      },
      configError: {
        title: 'Помилка конфігурації',
        description: 'Ключ сповіщення відсутній.',
      },
      enabled: 'Сповіщення ввімкнено!',
      tokenError: 'Не вдалося отримати токен',
      subscriptionError: 'Помилка підписки',
      disabled: 'Сповіщення вимкнено.',
      unsubscribeError: 'Помилка під час скасування підписки',
    },
  },
} as const;
