
export default {
  common: {
    cancel: 'Отказ',
  },
  welcomeScreen: {
    title: 'Добре дошли в PrEPy',
    subtitle: 'Вашият интелигентен спътник за PrEP при поискване. Проследявайте дозите си, бъдете защитени и управлявайте сесиите си с увереност.',
    cta: 'Започнете сесия PrEP',
  },
  welcomeDialog: {
    title: 'Активирайте известията',
    description: {
      part1: 'За вашата безопасност силно се препоръчва да активирате известията. Това ще позволи на PrEPy да ви изпраща напомняния за дозите хапчета.',
      part2: 'Пропускането на напомняне може да компрометира вашата защита.',
    },
    confirm: 'Разбрах, активирайте известията',
  },
  settings: {
    title: 'Настройки',
    description: 'Управлявайте вашите данни и предпочитания.',
    notifications: {
      title: 'Известия',
      description: 'Получавайте напомняне за всяка доза, за да осигурите защитата си.',
      enabled: 'Известията са активирани',
      disabled: 'Известията са деактивирани',
      loading: 'Зареждане...',
      denied: 'Блокирали сте известията. За да ги активирате отново, трябва да разрешите известия за този сайт в настройките на браузъра си, след което да презаредите страницата.',
      disabledWarning: 'Напомнянията за дози са деактивирани. Няма да получавате известия, което може да доведе до пропуснати дози.',
    },
    language: {
      title: 'Език',
      description: 'Изберете езика на показване на приложението.',
      select: 'Изберете език',
    },
    theme: {
      title: 'Режим на показване',
      description: 'Изберете между светла и тъмна тема.',
    },
    clearHistory: {
      button: 'Изтрий моята история',
      dialog: {
        title: 'Абсолютно сигурни ли сте?',
        description: 'Това действие е необратимо. Всички данни от сесията и историята на хапчетата ще бъдат изтрити за постоянно.',
        confirm: 'Да, изтрий данните ми',
      },
    },
  },
  logDoseDialog: {
    initial: {
      title: 'Започнете вашата сесия',
      description: 'Ще започнете с 2 хапчета. Потвърдете кога сте приели началната си доза.',
    },
    regular: {
      title: 'Запишете вашата доза',
      description: 'Потвърдете кога сте приели хапчето си.',
    },
    missed: {
      title: 'Пропусната доза',
      description: 'Изглежда сте пропуснали доза. Изберете опция, за да актуализирате статуса си.',
      earlier: 'Взех 1 хапче по-рано',
      restart: 'Рестартирайте с 2 хапчета',
    },
    picker: {
      description: 'Изберете датата и часа на приемане на {count} хапче(та).',
      confirm: 'Потвърдете часа',
    },
    pills: {
      earlier: 'Взех {count} хапче(та) по-рано',
      now: 'Взех {count} хапче(та) сега',
    },
  },
  doseHistory: {
    title: 'Дневник',
    description: 'Вашите дейности за последните 90 дни.',
    event: {
      start: 'Сесията е започнала',
      dose: 'Хапче е взето',
      stop: 'Сесията е приключила',
      unknown: 'Неизвестно събитие',
    },
    empty: {
      title: 'Няма записана дейност.',
      subtitle: 'Започнете сесия, за да започнете.',
    },
  },
  status: {
    inactive: 'Неактивен',
    loading: 'Защитата е в очакване...',
    effective: 'Защитата е ефективна',
    missed: 'Пропусната доза',
    lapsed: 'Защитата е изтекла',
    ended: 'Сесията е приключила',
    loadingClient: 'Зареждане...',
    riskWarning: 'Ако сте имали незащитен секс извън периода на защита, моля, направете си тест.',
  },
  protection: {
    startsIn: 'Ще бъде активна след {time}',
    text: {
      lapsed: 'Пропуснали сте една или повече дози. Вашата защита вече не е гарантирана.',
      lessThan3doses: 'Ако продължите да приемате дозите до {dateTroisiemeJour}, вашите контакти между {datePriseDemarrage} и {dateLendemain} ще бъдат защитени.',
      moreThan3doses: 'Вашите контакти преди {dateAvantDernierePrise} са защитени от PrEP.',
    },
  },
  dose: {
    nextIn: 'Следваща доза след {time}',
    timeLeft: 'Имате {time} да вземете хапче',
    now: 'Вземете хапчето си сега!',
  },
  dashboard: {
    logDose: 'Взех си дозата',
    endSession: 'Край на сесията',
    startSession: 'Започни нова сесия',
    stopPrepInfo: 'За да спрете PrEP, продължете да приемате по 1 хапче на ден в продължение на 2 дни след последния ви полов акт.',
    endSessionDialog: {
      title: 'Да приключи ли сесията PrEP?',
      description: 'Това ще спре напомнянията за известия. Вашата защита ще бъде изчислена въз основа на последната ви доза.',
      confirm: 'Да, край',
    },
  },
  session: {
    end: {
      toast: {
        title: 'Сесията приключи',
        description: 'Напомнянията за известия са спрени.',
      },
    },
    clear: {
      toast: {
        dev: 'Тестовите данни са презаредени',
        title: 'Данните са изчистени',
        description: 'Вашата история и предпочитания са изтрити.',
      },
    },
  },
  notifications: {
    toast: {
      unsupported: 'Браузърът не е съвместим',
      denied: {
        title: 'Известията са отказани',
        description: 'Можете да ги активирате отново в настройките на браузъра си.',
      },
      configError: {
        title: 'Грешка в конфигурацията',
        description: 'Липсва ключът за известия.',
      },
      enabled: 'Известията са активирани!',
      tokenError: 'Не може да се извлече токен',
      subscriptionError: 'Грешка при абонамента',
      disabled: 'Известията са деактивирани.',
      unsubscribeError: 'Грешка по време на отписване',
    },
  },
} as const;

    